#include <bits/stdc++.h>
using namespace std;
int main()
{ 
//题目简介：把一堆大小不等的物品装进箱子里面，箱子容量为100，看能装几个箱。一个箱只能刚好装100，多的就放到下个箱子去
//输入第一行给出物品个数N（≤1000）；第二行给出N个正整数s ≤100，表示第i项物品的大小）。
//输入 8 \n 60 70 80 90 30 40 10 20
//输出：
60 1
70 2
80 3
90 4
30 1
40 5
10 1
20 2
5
//这题属于，二维数组的一种模拟题，这类题的思路就是，拿草稿纸，把他实现的流程，都过一遍，然后再通过代码实施。
//
//

    int n, i, j, sum, t = 0, box = 0, a[1001][2] = {0};
    cin >> n;
    for (i = 0; i < n; i++)
        cin >> a[i][0];
    for (i = 0; i < n; i++)
    {
        if (a[i][1] == 0)
        {
            a[i][1] = ++box;
            sum = a[i][0];
        }
        for (j = i + 1; j < n; j++)
            if (a[i][0] + a[j][0] <= 100 && a[j][1] == 0)
            {
                sum += a[j][0];
                if (sum <= 100)
                    a[j][1] = box;
                else sum-=a[j][0];
            }
    }
    for (i = 0; i < n; i++)
        printf("%d %d\n", a[i][0], a[i][1]);
    cout << box;
}